Revit 2026 API

# PointCloudColorSettings Class

---

The color settings which are applied to a PointCloudInstance element, or one of its scans.

SystemObject Autodesk.Revit.DB.PointCloudsPointCloudColorSettings

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PointCloudColorSettings : IDisposable
```
```vb
Public Class PointCloudColorSettings
	Implements IDisposable
```
```cpp
public ref class PointCloudColorSettings : IDisposable
```
```fsharp
type PointCloudColorSettings =
    class
        interface IDisposable
    end
```

The PointCloudColorSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PointCloudColorSettings | Constructs color settings object with default colors. |
|  | PointCloudColorSettings(PointCloudColorMode) | Constructs color settings object with default color for given color mode. |
|  | PointCloudColorSettings(PointCloudColorSettings) | Constructs a copy of source object. |
|  | PointCloudColorSettings(Color, Color) | Constructs color settings object from given colors. |

|  | Name | Description |
| --- | --- | --- |
|  | Color1 | Color 1 |
|  | Color2 | Color 2 |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Assign | Assigns values of the source settings to this object. |
|  | Dispose | Releases all resources used by the PointCloudColorSettings |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Check if the contents of two settings are equal. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

For different color modes (PointCloudColorMode), the color settings mean different things:

  * for single color, color1 means the display color
  * for other modes (intensity, elevation), color1 and color2 form a gradient from min to max
  * for no overrides and normals, color1 and color2 are not used

#### Reference

Autodesk.Revit.DB.PointClouds Namespace